# Задание 4
row = 'Lambdadambda'
print(row[2]) # третий символ строки
print(row[10]) # предпоследний символ строки
print(row[:5]) # первые пять символов строки
print(row[:10]) # строка без последних двух символов
print(row[::2]) # символы с четными индексами
print(row[1::2]) # символы с нечетными индексами
print(row[::-1]) # строка в обратном порядке
print(row[::-2]) # символы строки в обратном порядке, через 1
print(len(row)) # длина строки